In [1]:
import numpy as np
import pandas as pd

In [3]:
df = pd.read_csv('car_sales.csv')
df

,Date,Salesperson,Customer Name,Car Make,Car Model,Car Year,Sale Price,Commission Rate,Commission Earned
0,2022-08-01,Monica Moore MD,Mary Butler,Nissan,Altima,2018,15983,0.070495,1126.73
1,2023-03-15,Roberto Rose,Richard Pierce,Nissan,F-150,2016,38474,0.134439,5172.40
2,2023-04-29,Ashley Ramos,Sandra Moore,Ford,Civic,2016,33340,0.114536,3818.63
3,2022-09-04,Patrick Harris,Johnny Scott,Ford,Altima,2013,41937,0.092191,3866.20
4,2022-06-16,Eric Lopez,Vanessa Jones,Honda,Silverado,2022,20256,0.113490,2298.85
...,...,...,...,...,...,...,...,...,...
94,2023-01-23,Donald Guerra,John Goodwin,Ford,Altima,2020,25964,0.098219,2550.15
95,2023-03-13,Alyssa Boyd,James Turner,Nissan,F-150,2016,10872,0.109547,1190.99
96,2022-12-31,Ryan Barnes,Mary Wong,Toyota,Silverado,2018,17650,0.105740,1866.32
97,2022-12-29,Megan Kaiser,Christopher Alexander,Ford,Civic,2013,25256,0.055621,1404.76
98,2023-04-16,Michael Jordan,Thomas Blankenship,Chevrolet,Altima,2014,31462,0.103951,3270.51

In [4]:
df.head()

,Date,Salesperson,Customer Name,Car Make,Car Model,Car Year,Sale Price,Commission Rate,Commission Earned
0,2022-08-01,Monica Moore MD,Mary Butler,Nissan,Altima,2018,15983,0.070495,1126.73
1,2023-03-15,Roberto Rose,Richard Pierce,Nissan,F-150,2016,38474,0.134439,5172.40
2,2023-04-29,Ashley Ramos,Sandra Moore,Ford,Civic,2016,33340,0.114536,3818.63
3,2022-09-04,Patrick Harris,Johnny Scott,Ford,Altima,2013,41937,0.092191,3866.20
4,2022-06-16,Eric Lopez,Vanessa Jones,Honda,Silverado,2022,20256,0.113490,2298.85

In [5]:
df.tail()

,Date,Salesperson,Customer Name,Car Make,Car Model,Car Year,Sale Price,Commission Rate,Commission Earned
94,2023-01-23,Donald Guerra,John Goodwin,Ford,Altima,2020,25964,0.098219,2550.15
95,2023-03-13,Alyssa Boyd,James Turner,Nissan,F-150,2016,10872,0.109547,1190.99
96,2022-12-31,Ryan Barnes,Mary Wong,Toyota,Silverado,2018,17650,0.105740,1866.32
97,2022-12-29,Megan Kaiser,Christopher Alexander,Ford,Civic,2013,25256,0.055621,1404.76
98,2023-04-16,Michael Jordan,Thomas Blankenship,Chevrolet,Altima,2014,31462,0.103951,3270.51

In [6]:
df["Car Make"]

0        Nissan
1        Nissan
2          Ford
3          Ford
4         Honda
        ...
94         Ford
95       Nissan
96       Toyota
97         Ford
98    Chevrolet
Name: Car Make, Length: 99, dtype: object

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99 entries, 0 to 98
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Date               99 non-null     object
 1   Salesperson        99 non-null     object
 2   Customer Name      99 non-null     object
 3   Car Make           99 non-null     object
 4   Car Model          99 non-null     object
 5   Car Year           99 non-null     int64
 6   Sale Price         99 non-null     int64
 7   Commission Rate    99 non-null     float64
 8   Commission Earned  99 non-null     float64
dtypes: float64(2), int64(2), object(5)
memory usage: 7.1+ KB

In [8]:
df.describe()

          Car Year    Sale Price  Commission Rate  Commission Earned
count    99.000000     99.000000        99.000000          99.000000
mean   2016.161616  28622.989899         0.104150        2984.722323
std       3.616027  10867.683713         0.027091        1415.463346
min    2010.000000  10313.000000         0.051853         804.140000
25%    2013.000000  18382.000000         0.084937        1920.225000
50%    2016.000000  28160.000000         0.102855        2720.130000
75%    2019.000000  36864.500000         0.124378        3807.860000
max    2022.000000  48916.000000         0.149926        6678.720000

In [ ]:
df['Salesperson'].unique()

AttributeError: 'numpy.ndarray' object has no attribute 'count'

In [13]:
df['Salesperson'].value_counts

<bound method IndexOpsMixin.value_counts of 0     Monica Moore MD
1        Roberto Rose
2        Ashley Ramos
3      Patrick Harris
4          Eric Lopez
           ...
94      Donald Guerra
95        Alyssa Boyd
96        Ryan Barnes
97       Megan Kaiser
98     Michael Jordan
Name: Salesperson, Length: 99, dtype: object>

In [21]:
df['Customer Name'].sort_values(ascending=False)

84    Zachary Freeman
52     Virginia Joyce
4       Vanessa Jones
6        Tyler Lawson
73        Toni Acosta
           ...
44        Amy Sanchez
80          Amy Burns
43       Amanda Combs
19      Alison Walker
81      Adrian Miller
Name: Customer Name, Length: 99, dtype: object

In [27]:
#Works on rows + columns
df.iloc[10,1]

#works on only rows
df.loc[11]

Date                         2023-01-29
Salesperson          Richard Richardson
Customer Name               Justin Gray
Car Make                         Toyota
Car Model                     Silverado
Car Year                           2022
Sale Price                        48224
Commission Rate                0.090592
Commission Earned               4368.72
Name: 11, dtype: object

In [32]:
# 10 to 20 rows , 1 to 4 columns
df.iloc[10:20,1:4]

# 10 to 20 rows 2-> skip every 2nd row , 1 to 4 columns
df.iloc[10:20:2,1:4]

df.iloc[10:20:2,4:]

    Car Model  Car Year  Sale Price  Commission Rate  Commission Earned
10  Silverado      2021       41259         0.092541            3818.16
12     Altima      2017       36409         0.122349            4454.60
14     Altima      2021       10313         0.103875            1071.26
16     Altima      2010       39916         0.052008            2075.94
18      Civic      2013       17158         0.127228            2182.97

In [33]:
# show only selected columns

df.iloc[1::2,[1,2,6,5,7]]

,Salesperson,Customer Name,Sale Price,Car Year,Commission Rate
1,Roberto Rose,Richard Pierce,38474,2016,0.134439
3,Patrick Harris,Johnny Scott,41937,2013,0.092191
5,Terry Perkins MD,John Olsen,14769,2015,0.077247
7,Norma Watkins,Michael Bond,46233,2015,0.071624
9,Andrew Smith,Ashley Moreno DDS,16309,2018,0.149926
11,Richard Richardson,Justin Gray,48224,2022,0.090592
13,Lisa Campbell,Lisa Anderson,29628,2011,0.112326
15,James Velasquez,Natalie Thompson,36607,2016,0.055251
17,Amy Solomon,Taylor Moore,18482,2018,0.086185
19,Patricia Reynolds,Alison Walker,28796,2014,0.093451
21,Jennifer Morris,Kristin Robinson,36895,2011,0.128288
23,Matthew White,Nancy Martinez,30184,2020,0.136991
25,Faith Pierce,Jimmy Dunn,35279,2016,0.063400
27,Amber Cooper,Claire Day,30296,2018,0.100170
29,Jason Cabrera,Rebecca Hansen,20725,2012,0.145073
31,Christian Williams,Jerry Baker,41216,2019,0.128691
33,Shawn Cummings,Kelly Beasley,15064,2013,0.053382
35,Jennifer Stevens MD,Brittany Gonzales,23249,2019,0.141622
37,Julie Aguirre,Timothy Mccoy,38307,2018,0.079531
39,Nicole Williams,Richard Wolf,31941,2012,0.102855
41,Betty Young,Lynn Villarreal,44250,2015,0.115044
43,Lauren Hernandez,Amanda Combs,29108,2012,0.122977
45,Brian Moran,Matthew Peterson,14864,2013,0.077744
47,Jacob Bishop,Marc Caldwell,21224,2021,0.093014
49,John Newton,Carrie Hudson,45367,2016,0.081734
51,Kimberly Maldonado,Kristine Hernandez,39908,2014,0.108985
53,Valerie Sanchez,Carlos Fields,13508,2022,0.146756
55,David Gomez,Linda Conrad,46164,2019,0.144674
57,Jessica Flores,Carol Turner,27999,2014,0.090298
59,Carrie Gordon,Joseph Marquez,35989,2015,0.105520
61,Monique Green,Audrey Perry,26862,2022,0.095135
63,Walter Robinson,Jeffrey Gillespie,19526,2020,0.128315
65,Michelle Moore,Sharon Brooks,10371,2019,0.104991
67,Christopher Taylor,Denise Carter,29518,2017,0.072624
69,Katherine Harris,Lori Byrd,33493,2022,0.146898
71,Charles Cruz,Debra Hudson,18282,2015,0.148181
73,Hunter King,Toni Acosta,48163,2016,0.131807
75,Shawn Mullen,Jeremy Jones,16314,2018,0.149344
77,Tyler Freeman,Shannon Sutton,27067,2021,0.104673
79,Anna Johnson,Damon Baker,28865,2012,0.124314
81,Ashley English,Adrian Miller,45561,2022,0.116254
83,Becky Stafford,Seth Horne,24664,2016,0.124724
85,Deanna Rodriguez,Christopher Cruz,32968,2014,0.118714
87,Matthew Walker,Mary Perry,45162,2019,0.133707
89,Deborah Whitney,Sarah Watkins,45334,2013,0.136883
91,Christopher Oneill,Phillip Cox,18209,2022,0.097278
93,Stephen Ward,Chase Oneill,17038,2022,0.081520
95,Alyssa Boyd,James Turner,10872,2016,0.109547
97,Megan Kaiser,Christopher Alexander,25256,2013,0.055621